In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.random.randint(5,20,20).reshape(-1,5))
df

    0   1   2   3   4
0  10  14  18  13  11
1   9   9  14  10   9
2   8   6  12  10  11
3  11  13   5  12   8

In [5]:
df2 = pd.DataFrame(np.random.randint(-10,20,20).reshape(-1,5))
df2

    0  1   2   3   4
0  -2 -4  16 -10  -9
1  -3  0  11   4  13
2  10  4   9   5  -1
3   3  0  -7  10  -2

In [6]:
df + df2

    0   1   2   3   4
0   8  10  34   3   2
1   6   9  25  14  22
2  18  10  21  15  10
3  14  13  -2  22   6

In [7]:
df +1

    0   1   2   3   4
0  11  15  19  14  12
1  10  10  15  11  10
2   9   7  13  11  12
3  12  14   6  13   9

In [8]:
df > 10

       0      1      2      3      4
0  False   True   True   True   True
1  False  False   True  False  False
2  False  False   True  False   True
3   True   True  False   True  False

In [9]:
print(df[df>10])

      0     1     2     3     4
0   NaN  14.0  18.0  13.0  11.0
1   NaN   NaN  14.0   NaN   NaN
2   NaN   NaN  12.0   NaN  11.0
3  11.0  13.0   NaN  12.0   NaN

In [10]:
print(df[df[0] > 10])

    0   1  2   3  4
3  11  13  5  12  8

In [11]:
print(df[df[1]> 10])

    0   1   2   3   4
0  10  14  18  13  11
3  11  13   5  12   8

In [13]:
df.sort_values(by = 0)

    0   1   2   3   4
2   8   6  12  10  11
1   9   9  14  10   9
0  10  14  18  13  11
3  11  13   5  12   8

In [15]:
df.sort_values(by = [0,2])

    0   1   2   3   4
2   8   6  12  10  11
1   9   9  14  10   9
0  10  14  18  13  11
3  11  13   5  12   8

In [17]:
df.sort_values(by = 1,ascending = False)

    0   1   2   3   4
0  10  14  18  13  11
3  11  13   5  12   8
1   9   9  14  10   9
2   8   6  12  10  11

In [18]:
df.mean()

0     9.50
1    10.50
2    12.25
3    11.25
4     9.75
dtype: float64

In [19]:
df.2.mean()

SyntaxError: invalid syntax (<ipython-input-19-a7f68ea9fb36>, line 1)

In [20]:
df.mean(axis = 0)

0     9.50
1    10.50
2    12.25
3    11.25
4     9.75
dtype: float64

In [21]:
df.mean(axis = 1)

0    13.2
1    10.2
2     9.4
3     9.8
dtype: float64

In [22]:
df.sum()

0    38
1    42
2    49
3    45
4    39
dtype: int64

In [23]:
df.count()

0    4
1    4
2    4
3    4
4    4
dtype: int64

In [24]:
df.median()

0     9.5
1    11.0
2    13.0
3    11.0
4    10.0
dtype: float64

In [25]:
df.median(axis =1)

0    13.0
1     9.0
2    10.0
3    11.0
dtype: float64

In [26]:
df.quantile(0.25)

0     8.75
1     8.25
2    10.25
3    10.00
4     8.75
Name: 0.25, dtype: float64

In [27]:
df.quantile(0.75, axis = 1)

0    14.0
1    10.0
2    11.0
3    12.0
Name: 0.75, dtype: float64

In [28]:
df.max()

0    11
1    14
2    18
3    13
4    11
dtype: int64

In [29]:
df.std()

0    1.290994
1    3.696846
2    5.439056
3    1.500000
4    1.500000
dtype: float64

In [30]:
df.var()

0     1.666667
1    13.666667
2    29.583333
3     2.250000
4     2.250000
dtype: float64

In [31]:
df.corr()

          0         1         2         3         4
0  1.000000  0.907959 -0.403506  0.774597 -0.602464
1  0.907959  1.000000  0.008289  0.931725 -0.270501
2 -0.403506  0.008289  1.000000  0.112356  0.745636
3  0.774597  0.931725  0.112356  1.000000  0.037037
4 -0.602464 -0.270501  0.745636  0.037037  1.000000

In [33]:
df.apply(lambda x : x**(0.5)*10)

           0          1          2          3          4
0  31.622777  37.416574  42.426407  36.055513  33.166248
1  30.000000  30.000000  37.416574  31.622777  30.000000
2  28.284271  24.494897  34.641016  31.622777  33.166248
3  33.166248  36.055513  22.360680  34.641016  28.284271